from .generator import MazeGenerator
from .colors import END


def w_l(maze: MazeGenerator, status: str) -> str:
    space: str = ''
    if status == 'win':
        space = (' ' * (((maze.width * 4) - 64) // 2)
                 if ((maze.width * 4) - 64) > 0 else '')
    else:
        space = (' ' * (((maze.width * 4) - 74) // 2)
                 if ((maze.width * 4) - 74) > 0 else '')
    w = maze._wall

    win = (
            f'{space} {w * 2}╗   {w * 2}╗ ' +
            f'{w * 6}╗ {w * 2}╗   {w * 2}╗     ' +
            f'{w * 2}╗    {w * 2}╗{w * 2}╗{w * 3}╗ ' +
            f'  {w * 2}╗  {w * 2}╗\n' +
            f'{space} ╚{w * 2}╗ {w * 2}╔╝{w * 2}╔═══' +
            f'{w * 2}╗{w * 2}║   {w * 2}║   ' +
            f'  {w * 2}║    {w * 2}║{w * 2}║{w * 4}╗ ' +
            f' {w * 2}║  {w * 2}║\n' +
            f'{space}  ╚{w * 4}╔╝ {w * 2}║   {w * 2}║{w * 2}║' +
            f'   {w * 2}║    ' +
            f' {w * 2}║ {w}╗ {w * 2}║{w * 2}║{w * 2}╔{w * 2}╗ ' +
            f'{w * 2}║  {w * 2}║\n' +
            f'{space}   ╚{w * 2}╔╝  {w * 2}║   {w * 2}║{w * 2}║ ' +
            f'  {w * 2}║  ' +
            f'   {w * 2}║{w * 3}╗{w * 2}║{w * 2}║{w * 2}║╚{w * 2}╗' +
            f'{w * 2}║  ╚═╝\n' +
            f'{space}    {w * 2}║   ╚{w * 6}╔╝╚{w * 6}╔╝     ' +
            f'╚{w * 3}╔{w * 3}' +
            f'╔╝{w * 2}║{w * 2}║ ╚{w * 4}║  {w * 2}╗\n' +
            f'{space}    ╚═╝    ╚═════╝  ╚═════╝       ╚══╝╚══╝ ' +
            '╚═╝╚═╝  ╚═══╝  ╚═╝\n' + END)

    lose = (
            f'{space} {w*6}╗  {w*5}╗ {w*3}╗   {w*3}╗{w*7}╗     ' +
            f'{w*6}╗ {w*2}╗   ' +
            f'{w*2}╗{w*7}╗{w*6}╗ \n' +
            f'{space}{w*2}╔════╝ {w*2}╔══{w*2}╗{w*4}╗ {w*4}║{w*2}' +
            f'╔════╝    {w*2}' +
            f'╔═══{w*2}╗{w*2}║   {w*2}║{w*2}╔════╝{w*2}╔══{w*2}╗\n' +
            f'{space}{w*2}║  {w*3}╗{w*7}║{w*2}╔{w*4}╔{w*2}║{w*5}╗   ' +
            f'   {w*2}║   ' +
            f'{w*2}║{w*2}║   {w*2}║{w*5}╗  {w*6}╔╝\n' +
            f'{space}{w*2}║   {w*2}║{w*2}╔══{w*2}║{w*2}║╚{w*2}' +
            f'╔╝{w*2}║{w*2}╔══╝   '
            f'   {w*2}║   {w*2}║╚{w*2}╗ {w*2}╔╝{w*2}╔══╝  {w*2}' +
            f'╔══{w*2}╗\n' +
            f'{space}╚{w*6}╔╝{w*2}║  {w*2}║{w*2}║ ╚═╝ {w*2}║{w*7}╗' +
            f'    ╚{w*6}╔╝ ' +
            f'╚{w*4}╔╝ {w*7}╗{w*2}║  {w*2}║\n' +
            f'{space} ╚═════╝ ╚═╝  ╚═╝╚═╝     ╚═╝╚══════╝     ╚═════╝' +
            '   ╚═══╝  ' +
            '╚══════╝╚═╝  ╚═╝\n' + END)
    if status == 'win':
        return win
    return lose
